
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version O-2018.06-SP1 for linux64 - Jul 19, 2018 

                    Copyright (c) 1988 - 2018 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
Error: Current design is not defined. (UID-4)
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> results_conv
dc_shell> dc_shell> _rtl
dc_shell> dc_shell> 0
dc_shell> dc_shell> dc_shell> dc_shell> high
dc_shell> dc_shell> Information: Variable 'hdlin_enable_presto' is obsolete and is being ignored. (INFO-100)
Information: Variable 'hdlin_enable_presto' is obsolete and is being ignored. (INFO-100)
TRUE
dc_shell> all
dc_shell> dc_shell> %s[%d]
dc_shell> %s[%d]
dc_shell> dc_shell> dc_shell> dc_shell> Error: Current design is not defined. (UID-4)
0
dc_shell> dc_shell> dc_shell> true
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> 1
dc_shell> 1
dc_shell> 1
dc_shell> Verilog
dc_shell> dc_shell> dc_shell> dc_shell> true
dc_shell> dc_shell> 1
dc_shell> dc_shell> ./report/dc/
dc_shell> ./saif/
dc_shell> dc_shell> Information: Variable 'hdlin_use_cin' is obsolete and is being ignored. (INFO-100)
true
dc_shell> high
dc_shell> true
dc_shell> dc_shell> dc_shell> true
dc_shell> dc_shell> DesignWare
dc_shell> dc_shell> dc_shell> * typical.db
dc_shell> dc_shell> * typical.db dw_foundation.sldb standard.sldb
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> 
Reading Verilog Source Files

Loading db file '/classes/ee620/maieee/lib/tsmc-0.18/synopsys/typical.db'
Loading db file '/tools/rhel6/synopsys/syn/current/libraries/syn/dw_foundation.sldb'
Loading db file '/tools/rhel6/synopsys/syn/current/libraries/syn/standard.sldb'
Loading db file '/tools/rhel6/synopsys/syn/current/libraries/syn/gtech.db'
  Loading link library 'typical'
  Loading link library 'gtech'
Loading verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'
Running PRESTO HDLC
Compiling source file /home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v
Opening include file include/results_conv.h
Warning:  /home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v:320: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)

Statistics for case statements in always block at line 123 in file
	'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           124            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 135 in file
	'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           163            |    auto/auto     |
|           320            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 432 in file
	'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           445            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 495 in file
	'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           507            |    auto/auto     |
===============================================

Inferred memory devices in process
	in routine results_conv line 117 in file
		'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       go_reg        | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine results_conv line 123 in file
		'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      r852_reg       | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
|      r941_reg       | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
|      r1209_reg      | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
|      r1336_reg      | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
|      r1477_reg      | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
|      r1633_reg      | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
|      r697_reg       | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
|      r770_reg       | Flip-flop |  16   |  Y  | N  | N  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine results_conv line 135 in file
		'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   save_state_reg    | Flip-flop |   5   |  Y  | N  | Y  | N  | N  | N  | N  |
|     out_p2_reg      | Flip-flop |   8   |  Y  | N  | N  | Y  | N  | N  | N  |
|      dout_reg       | Flip-flop |   8   |  Y  | N  | N  | Y  | N  | N  | N  |
|    clear_ct_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|    start_ct_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|    clear_gt_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|      state_reg      | Flip-flop |   5   |  Y  | N  | Y  | N  | N  | N  | N  |
|    digit_clk_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|       opa_reg       | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|    start_gt_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|       opd_reg       | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|       opc_reg       | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|       opb_reg       | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     low_mag_reg     | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|    high_mag_reg     | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|      high_reg       | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
|       low_reg       | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
|     out_p1_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|   seen_quiet_reg    | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|    dout_flag_reg    | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|   clear_flag_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine results_conv line 432 in file
		'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      cmpb_reg       | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     gt_done_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|      cmpc_reg       | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|       gt_reg        | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|      cmpd_reg       | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|    gt_state_reg     | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine results_conv line 495 in file
		'/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      cmpf_reg       | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     ct_done_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|    ct_state_reg     | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
|      cmpr_reg       | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|       ok_reg        | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.db:results_conv'
Loaded 1 design.
Current design is 'results_conv'.
dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> dc_shell> dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> 
  Linking design 'results_conv'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  results_conv                /home/um2072/eeee722/um2072_f2023/uvm/results_conv/src/results_conv.db
  typical (library)           /classes/ee620/maieee/lib/tsmc-0.18/synopsys/typical.db
  dw_foundation.sldb (library) /tools/rhel6/synopsys/syn/current/libraries/syn/dw_foundation.sldb

1
dc_shell> 1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> 10
dc_shell> Current design is 'results_conv'.
Current design is 'results_conv'.
dc_shell> Current design is 'results_conv'.
Warning: Can't find design '*' in design 'results_conv'. (UID-95)
Current design is 'results_conv'.
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Current design is 'results_conv'.
{results_conv}
dc_shell> dc_shell> 1
dc_shell> Current design is 'results_conv'.
1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> Information: Checking out the license 'DesignWare'. (SEC-104)
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | O-2018.06-DWBB_201806.1 |     *     |
| Licensed DW Building Blocks        | O-2018.06-DWBB_201806.1 |     *     |
============================================================================


Information: There are 92 potential problems in your design. Please run 'check_design' for more information. (LINT-99)



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'results_conv'
Information: The register 'cmpr_reg[0]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[1]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[2]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[3]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[4]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[5]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[6]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[7]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[8]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[9]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[10]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[11]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[12]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[13]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[14]' will be removed. (OPT-1207)
Information: The register 'cmpr_reg[15]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[0]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[1]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[2]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[3]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[4]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[5]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[6]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[7]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[8]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[9]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[10]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[11]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[12]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[13]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[14]' will be removed. (OPT-1207)
Information: The register 'cmpf_reg[15]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[0]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[1]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[2]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[3]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[4]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[5]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[6]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[7]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[8]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[9]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[10]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[11]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[12]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[13]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[14]' will be removed. (OPT-1207)
Information: The register 'cmpd_reg[15]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[0]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[1]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[2]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[3]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[4]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[5]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[6]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[7]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[8]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[9]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[10]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[11]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[12]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[13]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[14]' will be removed. (OPT-1207)
Information: The register 'cmpc_reg[15]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[0]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[1]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[2]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[3]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[4]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[5]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[6]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[7]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[8]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[9]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[10]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[11]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[12]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[13]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[14]' will be removed. (OPT-1207)
Information: The register 'cmpb_reg[15]' will be removed. (OPT-1207)
Information: Added key list 'DesignWare' to design 'results_conv'. (DDB-72)
Information: The register 'save_state_reg[4]' is a constant and will be removed. (OPT-1206)
Information: The register 'out_p1_reg[7]' is a constant and will be removed. (OPT-1206)

  Updating timing information
Information: Updating design information... (UID-85)

  Beginning Implementation Selection
  ----------------------------------
  Processing 'results_conv_DW01_sub_0'
  Processing 'results_conv_DW01_sub_1'
  Processing 'results_conv_DW01_sub_2'
  Processing 'results_conv_DW01_sub_3'
  Processing 'results_conv_DW01_sub_4'
  Processing 'results_conv_DW01_sub_5'

  Beginning Mapping Optimizations  (High effort)
  -------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:03   72405.7      0.00       0.0       0.0                          
    0:00:03   72405.7      0.00       0.0       0.0                          
    0:00:03   72405.7      0.00       0.0       0.0                          
    0:00:03   72405.7      0.00       0.0       0.0                          
    0:00:03   72405.7      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:03   35755.5      0.00       0.0       0.0                          
    0:00:04   35742.2      0.00       0.0       0.0                          


  Beginning Critical Range Optimization
  -------------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:04   35742.2      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (max_area 0)
  -----------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:04   35742.2      0.00       0.0       0.0                          
    0:00:04   35742.2      0.00       0.0       0.0                          
    0:00:04   35519.3      0.00       0.0       0.0                          
    0:00:04   35356.3      0.00       0.0       0.0                          
    0:00:04   35269.8      0.00       0.0       0.0                          
    0:00:04   35233.2      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   35206.6      0.00       0.0       0.0                          
    0:00:04   34664.4      0.00       0.0       0.0                          
    0:00:04   34664.4      0.00       0.0       0.0                          
    0:00:04   34664.4      0.00       0.0       0.0                          
    0:00:04   34664.4      0.00       0.0       0.0                          
    0:00:04   34664.4      0.00       0.0       0.0                          
    0:00:04   34664.4      0.00       0.0       0.0                          
    0:00:04   34664.4      0.00       0.0       0.0                          
    0:00:05   34654.4      0.00       0.0       0.0                          
    0:00:05   34647.8      0.00       0.0       0.0                          
    0:00:05   34641.1      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          


  Beginning Critical Range Optimization
  -------------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:05   34637.8      0.00       0.0       0.0                          
    0:00:05   34637.8      0.00       0.0       0.0                          
Loading db file '/classes/ee620/maieee/lib/tsmc-0.18/synopsys/typical.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
1
dc_shell> dc_shell> dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> 1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Power Analysis
dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> dc_shell> Reading Backwards SAIF File
Loading db file '/classes/ee620/maieee/lib/tsmc-0.18/synopsys/typical.db'
Error: Line 11, The simulation duration time is less or equal to 0. (SAIF-9)
0
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 96 nets to module results_conv using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
1
dc_shell> Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/sdf/results_conv_tsmc18_rtl.sdf'. (WT-3)
1
dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> ./netlist/results_conv_tsmc18_rtl/
dc_shell> dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl/results_conv.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 96 nets to module results_conv using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
1
dc_shell> dc_shell> Current design is 'results_conv_DW01_sub_5'.
Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl/results_conv_DW01_sub_5.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'results_conv_DW01_sub_4'.
Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl/results_conv_DW01_sub_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'results_conv_DW01_sub_3'.
Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl/results_conv_DW01_sub_3.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'results_conv_DW01_sub_2'.
Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl/results_conv_DW01_sub_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'results_conv_DW01_sub_1'.
Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl/results_conv_DW01_sub_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'results_conv_DW01_sub_0'.
Writing verilog file '/home/um2072/eeee722/um2072_f2023/uvm/results_conv/netlist/results_conv_tsmc18_rtl/results_conv_DW01_sub_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
dc_shell> dc_shell> dc_shell> Current design is 'results_conv'.
{results_conv}
dc_shell> 
Thank you...
